/* Common */

"KDWEIBO" = "云之家HD";

"ACTION" = "操作";

"BACK" = "返回";

"OKAY" = "确定";

"SAVE" = "保存";

"DONE" = "完成";

"CANCEL" = "取消";

"CLOSE" = "关闭";

"YES" = "是";

"NO" = "否";

"START" = "开始";

"MORE" = "更多";

"ME" = "我";

"PASSWORD" = "密码";

"SEND" = "发送";

"RETRY" = "重试";

"MAIL" = "透过邮件发送";

"TAKE_PHOTO" = "拍照";

"PICK_PHOTO" = "选择照片";

"CLEAR_PICKED_PHOTO" = "清除图片";

"SHARING_PHOTOS" = "分享图片";

"COPY_TEXT" = "拷贝文本";

"SEARCH_ON_NETWORK" = "通过网络搜索";

"PROMPT_TITLE" = "提示";

"FROM_%@" = "来自%@";

"EORROR_HAPPEN" = "发生错误";

"PRAISE_TO" = "表扬了";

"COMMENT" = "回复";

"FORWARD" = "转发";

"COMMENT_%d" = "回复: %d";

"FORWARD_%d" = "转发: %d";


"PULL_UP_TO_UPDATE" = "上拉即可加载更多...";

"PULL_DOWN_TO_REFRESH" = "下拉即可刷新...";

"RELEASE_TO_REFRESH" = "松开即可刷新...";

"RELEASE_TO_UPDATE" = "松开即可加载更多...";

"NO_DATA_AND_PULL_DOWN_REFRESH" = "暂无数据，下拉可刷新";

"NO_DATA_AND_PULL_UP_REFRESH" = "暂无数据，上拉可刷新";

"NO_GROUP_AND_PULL_DOWN_REFRESH" = "你暂未加入任何小组\n下拉可刷新列表";

"LOADING..." = "加载中...";

"OPTIMIZING..." = "优化中...";

"REQUEST_ON_PROCESSING..." = "请求处理中...";


/* Status */

"STATUSES_DESTORY_STATUS_DID_FAIL" = "删除微博失败";

"NO_IDENTICAL_STATUS_IN_TRHEE_MIN" = "三分钟内不能发重复微博";


/* Comment */

"COMMENTS_DESTORY_COMMENT_DID_FAIL" = "删除评论失败";


/* Users */

"USERS_LOAD_FRIENDS_DID_FAIL" = "加载关注列表失败";

"USERS_LOAD_FOLLOWERS_DID_FAIL" = "加载粉丝列表失败";


/* Trends */

"TRENDS_LOAD_STATUSES_DID_FAIL" = "加载话题微博列表失败";

"TRENDS_FOLLOW_TREND_DID_FAIL" = "收藏话题失败";

"TRENDS_DESTORY_FOLLOW_TREND_DID_FAIL" = "取消收藏话题失败";


/* attachments */

"%d_ATTACHMENTS" = "%d个文档";


/* transfer progress */

"UNKNOWN_CONTENT_LENGTH" = "未知大小";

"LOAD_PROGESS_%@_%@" = "%@，已下载%@";

"UPLOAD_PROGESS_%@_%@" = "%@，已上传%@";



/* Sign in */

"MAIL_COMPOSE_OR_PHONE_NUMBER" = "邮箱/手机";

"SIGN_UP" = "注册";

"SIGN_IN" = "登录";

"LOGIN_MOBILE_PLACEHOLDER" = "/手机";

"NO_LOGGED_IN_USERS" = "暂无记录";

"USERNAME_CAN_NOT_BLANK" = "用户名不能为空。";

"PASSWORD_CAN_NOT_BLANK" = "密码不能为空。";

"SERVICES_UNAVAILABLE" = "服务暂时不可用，请稍候再试。";

"VERIFY_ACCOUNT_DID_FAIL" = "验证用户账号失败";

"VERIFY_ACCOUNT_DID_FAIL_NETWORK_ERROR" = "用户不在该社区，点击进入默认社区";

"LOAD_COMMUNITIES_DID_FAIL" = "载入社区列表失败";

"SIGN_IN_DID_FAIL_TITLE" = "登录失败";

"SIGN_IN_DID_FAIL_DETAILS" = "邮箱或密码不太对吧，重试一次？或是重置密码。";

"SIGNINING..." = "登录中...";

"SIGN_IN_RESET_PASSWORD" = "重置密码";

"AUTHORIZATION_TOKEN_DID_EXPIRED" = "授权码已过期，请重新获取授权后重新登录";

"AUTHORIZATION_TOKEN_DID_REJECTED" = "授权码被拒绝，请重新获取授权后重新登录";

"USERNAME_OR_PASSWORD_BROKEN" = "无效的用户名或密码";

/*Create Account*/

"SIGN_UP_KD_WEIBO" = "注册云之家";

"INPUT_ENTERPRISE_EMAIL" = "请输入企业邮箱(公司邮箱)";

"PROMPT_INFO_FOR_EMAIL_INPUT" = "请输入企业邮箱(公司邮箱)注册，暂时不支持163，QQ等公共邮箱注册";

"NEXT_STEP" = "下一步";

"SENT_ACTIVATION_EMAIL" = "已发送激活信";

"PLEASE_GO_TO_EMAILBOX_TO_ACTIVATE" = "请前往邮箱进行激活操作";

"INPUT_ERROR_PLEASE_RETRY" = "你的输入有误，请重新输入";

"EMAIL_FORMAT_IS_WRONG" = "邮箱格式不太对吧?";

"EMAIL_NOT_ENTERPRISE" = "你输入的似乎不是企业邮箱，我们暂时只支持企业邮箱注册哦";

"EXIST_EMAIL" = "当前企业邮箱已经注册，请重新输入！";

"EMAIL_VALIDATION" = "邮箱验证";

"GO_TO_EMAILBOX_TO_VALIDATE" = "去邮箱验证";

"RESEND_ACTIVATION_EMAIL" = "重发激活邮件";

"QUICK_VALIDATE" = "快速验证";

"SUBMIT_VALIDATION" = "提交验证";

"INPUT_EMAIL_PASSWORD" = "输入邮箱密码";

"PROMPT_PASSWORD_FOR_VALIDATION" = "密码仅用来验证用户身份";

"NAME" = "姓名: ";

"COMPANY" = "公司: ";

"PASSWORD" = "密码: ";

"CONFIRMPASSWORD" = "确认密码: ";

"DEPARTMENT" = "部门: ";

"POSITION" = "职位: ";

"USER_REAL_NAME_PLACEHOLDER" = "公司私密网络,请填写真实姓名";

"DEPARTMENT_PLACEHOLDER" = "填写正确的部门便于同事沟通";

/* Comments */

"LOADING_COMMENTS" = "正在加载回复";

"LOADING_FORWARDS" = "正在加载转发";

"NO_COMMENTS" = "暂时没有回复";

"NO_FORWARDS" = "还没有人转发";

"DEAD_LINE"="截止时间";

"RESULT_SHOW_AFTAR_VOTED"="投票后才能查看结果";


/* Friend timeline */

"COMPANY_ACTIVITY" = "公司动态";

"COMMUNITY_ACTIVITY" = "社区动态";

"MY_TIMELINE" = "我的关注";

"POPULAR_DISCUSSION" = "热门讨论";

"TIMELINE_TOGGLE_TIMELINE_NOTICE" = "按此可切换至\"我的关注\"和\"热门讨论\"";

"TIMELINE_SWITCH_TO_%@" = "已切换到\"%@\"";

"REFRESH_COMMUNITIES_DID_FAIL" = "更新社区列表失败";

"NOT_JOIN_COMMUNITY_YET" = "你暂未加入任何社区";

"NOT_JOIN_OTHERS_COMMUNITY_YET" = "你暂未加入其他社区";


"FAVORITES_CREATED_SUCCESS" = "收藏微博成功";

"FAVORITES_FAVORITED_YET" = "你已收藏过该微博";

"FAVORITES_CREATED_FAIL" = "收藏微博失败，请再尝试";

"FAVORITES_DESTORYED_SUCCESS" = "取消收藏微博成功";

"FAVORITES_DESTORYED_FAIL" = "取消收藏微博失败，请再尝试";


/* Message */

"MESSAGE" = "消息";

"AT_ME" = "@我";

"REPLY_TO_ME" = "回复";

"DIRECT_MESSAGE" = "短邮";

"REPLY_ON_STATUS" = "回复微博";

"REPLY_ON_COMMENT" = "回复回复";

"REPLY_ON_MY_STATUS" = "回复我的微博";

"REPLY_ON_MY_COMMENT" = "回复我的评论";

"REPLY_ON_%@_STATUS" = "回复%@的微博";

"REPLY_ON_%@_COMMENT" = "回复%@的评论";

"CREATE_NEW_DM" = "写短邮";

"STATUS_DID_DELETED" = "该微博已经被删除";


/* Direct message thread */

"DM_THREAD_LOAD_MORE" = "查看更多短邮";

"DM_SENDING_DIRECT_MESSAGE" = "短邮发送中，请稍候...";

"DM_SEND_DIRECT_MESSAGE_DID_FAIL" = "发送短邮失败，请再尝试";

"DM_THREAD_PARTICIPANTS" = "短邮成员";

"DM_%d_PHOTOS" = "[%d图片]";

"DM_%d_DOCUMENTS" = "[%d文档]";

"DM_ASK_SAVE_CONTENTS" = "短邮尚未发出，确定放弃发送？";

"DM_ASK_BACK_ON_SENDING" = "短邮发送中，确定返回?";

"DM_MULTIPLE_SHORT_MAIL" = "多人短邮";

"DM_SNED_MESSAGE_WITH_EMAIL" = "同时发一封邮件";

"NO_IDENTICAL_DM_IN_TRHEE_MIN" = "三分钟内不能发重复短邮";

"DM_THREAD_TITLE_%@_%d_PERSONS" = "%@[%d人]";

"DM_SYSTEM_MESSAGE_%@_%@_JOINED_SESSION" = "%@%@了会话";

/* Status Detail View */
"KD_STATUS_DETAIL_VIEW_TITLE" = "微博正文";

"KD_STATUS_DETAIL_VIEW_PROFILE" = "个人资料";

"KD_STATUS_DETAIL_VIEW_REPLY" = "回复";

"KD_STATUS_DETAIL_VIEW_DELETE" = "删除";

"KD_STATUS_DETAIL_VIEW_DETAIL" = "查看详情";

"KD_STATUS_DETAIL_VIEW_COPY" = "复制";

"KD_STATUS_DETAIL_VIEW_FORWARD" = "转发";

"KD_STATUS_DETAIL_VIEW_CANCEL" = "取消";

"KD_STATUS_DETAIL_VIEW_CONFIRM" = "确认";

"KD_STATUS_DETAIL_VIEW_UNEXIST" = "此微博不存在";

/* Groups */

"LIST_GROUPS_DID_FAIL" = "加载小组列表失败";
"NO_GROUP_ANNOUNCEMENT" = "暂无公告";

/* POSt direct message */

"DM_RECIPIENT_CAN_NOT_BE_EMPTY" = "请选择收件人";

/* POST */

"LONG_PRESS_TO_OPEN_DRAFT_BOX" = "长按打开草稿箱";

"SAVE_AS_DRAFT_SUCCESS" = "已保存, 你可以通过草稿箱重发";


/* User */

"USERNAME" = "用户名";

"INVALID_USERNAME" = "无效的用户名";

"USERNAME_INPUT_TIPS" = "用户名只允许中英文、数字、下划线（_）和点（.），4-20个字符";

"USERNAME_CAN_NOT_WITH_WHITESPACE" = "用户名不能包含空格";


/* User Profile */

"FRIENDSHIPS" = "关注";

"FOLLOWERS" = "粉丝";

"STATUSES" = "微博";

"TOPIC" = "话题";

"FAVORITES" = "收藏";

"DRAFTS" = "草稿箱";

"LOADING_USER_INFO" = "正在获取用户资料,请稍后...";

"CALCULATE_CACHE_SIZE" = " \n计算缓存大小中...\n ";


/* Edit User Profile */

"EDIT_USER_PROFILE" = "编辑个人资料";

"UPLOAD_USER_PROFILE_IMAGE" = "上传照片";

"PHOTO_ALBUMS" = "相册";

"TAKE_PHOTO" = "拍照";

"GENERATE_AVATAR_DID_FAIL" = "生成头像失败";

"UPDATING_USER_PROFILE" = "正在更新个人资料...";

"UPDATE_USER_PROFILE_DONE" = "更新个人资料成功";

"UPDATE_USER_USERNAME_DID_FAIL" = "更新用户名失败";

"UPDATE_USER_AVATAR_DID_FAIL" = "更新用户头像失败";

"ASK_DISCARD_PROFILE_CHANGES" = "确定要放弃保存吗？";


/* About */

"VERSION" = "版本";

"CHECK_NEW_VERSION" = "检查新版本";

"CLIENT_IS_LATEST_VERSION_NOW" = "当前已是最新版本";


/* Photo gallery */

"SAVE_TO_PHOTO_LIBRARY" = "保存到图片库";

"SAVE_PHOTO_DID_DONE" = "保存成功";

"PHOTO_GALLERY_TITLE_%d_%d" = "第 %d 张（共 %d 张）";

"LOAD_IMAGE_SOURCE_DID_FAIL" = "加载图片失败，请稍后再尝试。";


/* Draft */

"DELETE_DRAFT_DID_FAIL" = "删除草稿失败。";

"DELETE_DRAFT_WARNING" = "确定删除当前草稿?";

"EMPTY_DRAFTS_WARNING" = "确定清空所有草稿?";

"EDIT_DRAFT" = "进入编辑";

"DELETE_DRAFT" = "删除草稿";

"EMPTY" = "清空";

"ORIGIN_STATUS_DELETED_WHEN_REPOSE" = "原微博已删除，发送失败。";

"ORIGIN_COMMENT_DELETED_WHEN_REPOSE" = "原回复已删除，发送失败。";


/* Trends */

"TRENDS" = "话题";

"TRENDS_WEEKLY" = "最热话题";

"TRENDS_RECENTLY" = "最新话题";

"NO_TRENDS" = "暂无话题数据";

"IMPORT_TRENDS" = "插入话题";

"TRENDS_CREATE_OR_FILTER_BY" = "新建或搜索话题";

"TREADS_LIST_DEFAULT_DID_FAIL" = "加载话题列表失败";


/* Favorites */

"FAVORITES_STATUSES" = "收藏";

"FAVORITES_CANCEL" = "取消收藏";


/* Search */

"SEARCH" = "搜索";

"SEARCH_STATUSES" = "搜微博";

"SEARCH_USERS" = "找人";

"SEARCH_NO_MATCHED_DATA" = "暂无匹配数据";

"SEARCH_NO_MATCHED_STATUS" = "未搜到相关微博";

"SEARCH_NO_MATCHED_USER" = "未找到相关用户";

"SEARCH_NO_MATCHED_TREND" = "未搜到相关话题";


/* Mention */

"MENTION" = "提及";

"MENTION_SEARCH_BAR_PLACEHOLDER" = "搜索本地及网络联系人";

"MENTION_LOCAL_CONTACTS" = "本地联系人";

"MENTION_NETWORK_CONTACTS" = "网络联系人";

"MENTION_LOADING_NETWORK_CONTACTS" = "载入网络联系人";


/* Address Book */

"AB_ADDRESS_BOOK" = "通讯录";

"AB_SEARCH_CONTACTS_PLACEHOLDER" = "搜索姓名/拼音/电话/邮箱";

"AB_RECENTLY_CONTACTS" = "最近联系人";

"AB_ALL_CONTACTS" = "全部联系人";

"AB_FAVORITED_CONTACTS" = "收藏";

"AB_ACTION_SEND_DM" = "发短邮";

"AB_ACTION_PHONE_CALL" = "打电话";

"AB_ACTION_SEND_SMS" = "发短信";

"AB_VIEWING_CONTACT_PROFILE" = "查看名片";

"AB_RECORD_MOBILE" = "移动电话:";

"AB_RECORD_PHONE" = "办公电话:";

"AB_RECORD_EMAIL" = "邮箱:";

"AB_ACTION_FAVORITE" = "收藏";

"AB_ACTION_SAVE_TO_LOCAL" = "存到本地";

"AB_ACTION_FORWARD" = "转发";

"AB_SUBJECT_PHONE_NUMBER" = "号码";

"AB_PERSON_COUNT_MULTI" = "多个";

"AB_EXISTS_PERSON_%@_%@_%@" = "本地已经存在联系人%@:\n%@ (%@)";

"AB_NEW_PERSON" = "创建新的联系人";

"AB_ADD_TO_EXISTS_PERSON" = "添加现有联系人";

"AB_FAVORITE_CONTACT_DID_FAIL" = "收藏联系人失败";

"AB_UNFAVORITE_CONTACT_DID_FAIL" = "取消收藏联系人失败";

"AB_NO_MATCHED_CONTACTS" = "暂无相关联系人";

"AB_PERSON_COPIED_TO_PASTEBOARD" = "已复制到剪切板";


/* Common errors */

"LOAD_CONTENTS_DID_FAIL" = "加载失败，请检查网络是否连接。";

"NO_NETWORK_CONNECTION" = "暂无网络连接";

"UNKNOWN_ERROR" = "未知错误，请再尝试";

"NOT_SUPPORTED_PHONE_CALL" = "设备不支持打电话功能";

"NOT_SUPPORTED_SEND_SMS" = "设备不支持发短信功能";


/* Downloads */
"CANCLE_DOWNLOAD_WARNING" = "确定取消本次下载吗?";

"REVIEW_ORIGIN_STATUS" = "查看原微博";

"REVIEW_ORIGIN_DM" = "查看原短邮会话";

"OPEN_DOCUMENT" = "打开文档";

"DELETE_DOCUMENT" = "删除文档";

"DELETE_DOC_WARNING" = "是否确定删除该文档?";

"NAV_TITLE_DOWNLOADED" = "已下载文档";

"NAV_TITLE_NO_DOWNLOADED" = "无下载文档";

"NAV_TITLE_DM_STATUS" = "微博文档";

"NAV_TITLE_DM_DOC" = "短邮文档";

"FORMAT_UNSUPPOTED_ERROR" = "格式不支持或文件已损害";

"DOWNLOAD_ERROR_HAPPEN" = "下载错误，请检查网络连接是否正常";

"SIZE_OVER_%dM_NOTIFICATION"="文档大于%d兆，请耐心等待...";

"NO_DOWNLOADED_DOCUMENT" = "当前没有下载文档";

/*Network error*/
"NETWORK_ERROR_UNREACHABLE" = "无法连接到网络，请稍后再试";

"NETWORK_ERROR_OVERTIME" = "网络连接超时，请稍后再试";

/*Remove Cache*/

"REMOVE_CACHE_CONFIRM" = "确定要清除缓存?";

"REMOVE_DOWNLOADS_CACHE_ONLY%@" ="预计清除%@文档缓存";

"REMOVE_PICTURES_CACHE_ONLY%@" ="预计清除%@图片缓存";

"REMOVE_PICTURES_%@_DOWNLOADS_CACHE_%@" ="预计清除%@图片缓存和%@文档缓存";

"NO_CACHE_TO_REMOVE" = "没有需要清除的缓存";

"REMOVING_CACHE" = "正在清除缓存";

"ERROR_IN_REMOVAL" = "清除缓存失败";

"SUCCESS_IN_REMOVAL" = "清除缓存成功";

/*Timeline presentation*/

"LAYOUT_THEME_MODE" = "阅读模式";

"PREVIE_VIEW_PATTERN" = "预览图模式";

"ONLY_WORDS_PATTERN" = "经典模式";

/*application */
"ENTERPRISE_APPLICATION" = "企业应用";

"OPEN_IN_SAFARI" = "在Safari中打开";

"NO_APPLICATION_AVAILABLE"="您的企业暂未开通任何应用";

"GO_TO_INSTALL_APPLICATION%@" = "%@ 尚未安装，是否前往安装？";

/*unread */
"UNREAD_COMMENT_YOU" = "回复了你";
"UNREAD_MENTION_YOU" = "提及了你";
"UNREAD_DIRECTMESSAGE_YOU" = "给你发短邮了";
